package gui3;

import javax.swing.*;


//Само задание:
//Линия мужской одежды включает рубашки, брюки, куртки, пальто
// галстуки и обувь. Создайте тип данных enum, позволяющий
//предста вить эти шесть типов одежды. Затем создайте класс
//MensClothingitem. Каждый экземпляр этого класса включает поле
//kind (одно из шести значений enum) и поле name (например, со значением
//  Casual Summer Design # 7).
//Напишите п рограмму, отображающую фрейм (как на рис. 1 0.1 ) .
//Фрейм содержит шесть строк, предназначенных для описания полного
// мужского гардероба.


public class MensMaker {
    public static void main(String[] args) {
        new NewMeans();
    }
}
